---
kind: property
id: P:Autodesk.Revit.DB.SweptBlend.TopSketch
source: html/6faa9e0c-ce3b-3e05-1c1a-355aba8259e8.htm
---
# Autodesk.Revit.DB.SweptBlend.TopSketch Property

The top profile sketch of the swept blend.

## Syntax (C#)
```csharp
public Sketch TopSketch { get; }
```

## Remarks
If the top profile is based on a family symbol, this property is Nothing nullptr a null reference ( Nothing in Visual Basic) .